[
    {
      "id": 1,
      "title": "Obedient Cat",
      "description": "This file has a flag in plain sight (aka \"in-the-clear\")",
      "hint": "Try to read the content from file",
      "filename": "flag",
      "points": 5
    },
    {
      "id": 2,
      "title": "Mod 26",
      "description": "Cryptography can be easy, do you know what ROT13 is? cvpbPGS{arkg_gvzr_V'yy_gel_2_ebhaqf_bs_ebg13_MAZyqFQj}",
      "hint": "This can be solved online if you don't want to do it by hand!",
      "filename": "",
      "points": 10
    },
    {
      "id": 3,
      "title": "Tab, Tab, Attack",
      "description": "Using tab-complete in the Terminal will add years to your life, especially when dealing with long, rambling directory structures and filenames like Addadshashanammu.zip.",
      "hint": "After `unzip`ing, this problem can be solved with 11 button-presses...(mostly Tab)...",
      "filename": "Addadshashanammu.zip",
      "points": 10
    },
    {
      "id": 4,
      "title": "Inspect HTML",
      "description": "Can you get the flag? Open a new Tab, Go to this website and see what you can discover. website: 'http://saturn.picoctf.net:64200/'",
      "hint": "What is the web inspector in web browsers?",
      "filename": "",
      "points": 10
    },
    {
      "id": 5,
      "title": "The Number",
      "description": "The numbers... what do they mean?",
      "hint": "How many letters are in the English alphabet?",
      "filename": "the_numbers.png",
      "points": 10
    },
    {
      "id": 6,
      "title": "PW Crack",
      "description": "Can you crack the password to get the flag? Download the password checker and you'll need the encrypted flag in the same directory too.",
      "hint": "The str_xor function does not need to be reverse engineered for this challenge. Does that encoding look familiar?",
      "filename": "PW_Crack.zip",
      "points": 15
    },
    {
      "id": 7,
      "title": "Matryoshka doll",
      "description": "Matryoshka dolls are a set of wooden dolls of decreasing size placed one inside another. What's the final one? Download the image",
      "hint": "Wait, you can hide files inside files? But how do you find them?",
      "filename": "dolls.jpg",
      "points": 20
    },
    {
      "id": 8,
      "title": "Glory of the Garden",
      "description": "This garden contains more than it seems.",
      "hint": "What is a hex editor?",
      "filename": "garden.jpg",
      "points": 20
    }
  ]